vehicle_mapper/app/sidekiq/add_gps_job.rb

  def check_vehicle(vehicle)
    @vehicle = Vehicle.find_by(plate: vehicle)
    if @vehicle
      return @vehicle
    else
      @vehicle = Vehicle.new(plate: vehicle)
      @vehicle.save
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."plate" = $1 LIMIT $2  [["plate", "HA-3452"], ["LIMIT", 1]]
INSERT INTO "vehicles" ("plate", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["plate", "Holita"], ["created_at", "2024-08-21 09:58:57.868748"], ["updated_at", "2024-08-21 09:58:57.868748"]]