vehicle_mapper/app/controllers/api/v1/vehicle_controller.rb

SELECT "waypoints".* FROM "waypoints" WHERE "waypoints"."vehicles_id" = $1  [["vehicles_id", 1]]
---
  def show
    @vehicles = Vehicle.find_by(plate: params[:id])
    if @vehicles
      @waypoints = Waypoint.where(vehicles_id: @vehicles[:id])