vehicle_mapper/app/controllers/api/v1/vehicle_controller.rb

SELECT "vehicles".* FROM "vehicles"
SELECT "waypoints"."id", "waypoints"."latitude", "waypoints"."longitude", "waypoints"."sent_at" FROM "waypoints" WHERE "waypoints"."vehicles_id" = $1  [["vehicles_id", 1]]
---
  def index
    @vehicles_with_data = []
    @vehicles = Vehicle.all.each do |vehicle|
      @waypoints = Waypoint.select(:id, :latitude, :longitude, :sent_at).where(vehicles_id: vehicle.id)

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."plate" = $1 LIMIT $2  [["plate", "HA-3452"], ["LIMIT", 1]]
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "waypoints".* FROM "waypoints" WHERE "waypoints"."vehicles_id" = $1  [["vehicles_id", 1]]
---
  def show
    @vehicles = Vehicle.find_by(plate: params[:id])
    if @vehicles
      @waypoints = Waypoint.where(vehicles_id: @vehicles[:id])