vehicle_mapper/app/controllers/api/v1/waypoint_controller.rb

  def create
    @waypoint_data = waypoint_params
    @vehicle = check_vehicle(params[:vehicle_identifier])
    @dwaypoint = Waypoint.new(
      latitude: waypoint_params[:latitude],
      longitude: waypoint_params[:longitude],
      vehicles_id: @vehicle[:id],
      sent_at: waypoint_params[:sent_at]
    )

    if @dwaypoint.save
---
INSERT INTO "waypoints" ("latitude", "longitude", "sent_at", "created_at", "updated_at", "vehicles_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["latitude", "20.23"], ["longitude", "-0.56"], ["sent_at", "2016-06-02 20:45:00"], ["created_at", "2024-08-18 22:35:00.648310"], ["updated_at", "2024-08-18 22:35:00.648310"], ["vehicles_id", 1]]

  def destroy
    @waypoints = Waypoint.find(params[:id])
---
SELECT "waypoints".* FROM "waypoints" WHERE "waypoints"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def check_vehicle(vehicle)
    @vehicle = Vehicle.find_by(plate: vehicle)
    if @vehicle
      return @vehicle
    else
      @vehicle = Vehicle.new(plate: vehicle)
      @vehicle.save
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."plate" = $1 LIMIT $2  [["plate", "HA-3452"], ["LIMIT", 1]]
INSERT INTO "vehicles" ("plate", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["plate", "HA-3452"], ["created_at", "2024-08-18 22:33:48.162299"], ["updated_at", "2024-08-18 22:33:48.162299"]]